# IFC_DeleteDSField

## Description
Deletes field from Data Sheet.

```pascal
FUNCTION IFC_DeleteDSField(
				objectName    : STRING;
				dataSheetName : STRING;
				fieldLabel    : STRING) : BOOLEAN;
```

```python

def vs.IFC_DeleteDSField(objectName, dataSheetName, fieldLabel):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectName|STRING||
|dataSheetName|STRING||
|fieldLabel|STRING||

## Version
Availability: from Vectorworks 2023.4
## Category
* IFC